app/views/users/analytics.html.erb

SELECT COUNT(*) FROM "users"
SELECT "reviews"."created_at" FROM "reviews"
SELECT COUNT(*) FROM "reviews"
SELECT COUNT(*) FROM "breweries"
SELECT COUNT(*) FROM "beers"
SELECT "reviews"."content" FROM "reviews"
---
<div class = "analytics">
Total number of users: <%= @user_count = User.all.count %><br>
Total number of reviews: <%= @reviews = Review.all.count %><br>
Total number of breweries: <%= Brewery.all.count %><br>
Total number of beers: <%= Beer.all.count %><br>
<br>
Shortest review: <% reviews = Review.select(:content) %>

SELECT "reviews"."created_at" FROM "reviews"
---
Latest review: "<%= @sorted_content[-1] %>"<br>
Latest review timestamp: <% reviews = Review.select(:created_at) %>

SELECT "reviews".* FROM "reviews"
---
<br><br>
Total tracked beers for all user reviews: <% reviews = Review.all %>

SELECT "reviews"."rating" FROM "reviews"
---
Tracked beers per user: <%= @total_tracked / @user_count %><br>
Average rating for all beers: <% ratings = Review.all.select(:rating) %>