app/views/users/show.html.erb

                <b>Reviewed Beers:</b>
                <% user_reviews = Review.where(user_id: @user)%>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]

                        <% beer_ids.each do |beer| %>
                        <% beer = Beer.find_by(id: beer.beer_id) %>
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    <br>
    <% user_reviews = Review.where(user_id: @user) %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]