app/views/breweries/index.html.erb

SELECT DISTINCT "breweries"."id", "breweries"."name" FROM "breweries"
---
<div class="brewery_index">
<% breweries = Brewery.select(:id, :name).distinct%>