app/views/beers/index.html.erb

<h2> Top Ten Rated Beers </h2>
   <% Beer.top_beers.each do |b| %>
---
SELECT "beers".* FROM "beers"