app/views/beers/new.html.erb

    <br>
    <%= f.collection_check_boxes(:id, Brewery.all, :id, :name)%>
---
SELECT "breweries".* FROM "breweries"