app/views/beers/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 1]]
---
                        <div class = "beer_list1">
                        <% @beer.reviews.each do |r| %>