app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers" ORDER BY "beers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @beers = Beer.first

INSERT INTO "beers" ("name", "brand", "style", "abv", "strength", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test beer"], ["brand", "ABC"], ["style", "123"], ["abv", 5.0], ["strength", "LIGHT"], ["created_at", "2020-03-05 22:14:33.709136"], ["updated_at", "2020-03-05 22:14:33.709136"]]
---
  def create
      @beer = Beer.new(beer_params)
       if @beer.valid?
        @beer.save

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @beer = Beer.find(params[:id])

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "beers" SET "likes" = ?, "updated_at" = ? WHERE "beers"."id" = ?  [["likes", 1], ["updated_at", "2020-03-05 22:32:22.311836"], ["id", 1]]
---
  def like_beer
    @beer = Beer.find(params[:id])
    @beer.like
    @beer.save