app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @brewery = Brewery.find(params[:id])