app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "rating", "user_id", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Hello :)"], ["rating", 3], ["user_id", 1], ["beer_id", 1], ["created_at", "2020-03-05 22:16:47.447567"], ["updated_at", "2020-03-05 22:16:47.447567"]]
---
  def create
    @review = Review.new(review_params)
    if @review.valid?
      @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy