app/models/beer.rb

    def average_rating
        if self.reviews.size > 0
        self.reviews.average(:rating)
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 1]]

    def self.top_beers
        Beer.all.sort_by(&:average_rating).reverse.first(10)
---
SELECT "beers".* FROM "beers"