app/views/reviews/new.html.erb

SELECT "beers".* FROM "beers"
---
Select a beer:<br>
<%= f.collection_select(:beer_id, Beer.all, :id, :name) %>

SELECT "users".* FROM "users"
---
Select a user:<br>
<%= f.collection_select(:user_id, User.all, :id, :username) %>