app/views/reviews/show.html.erb

<% uid = @review.user_id %>
<% userrecord = User.find_by id: uid %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

<% bid = @review.beer_id %>
<% beerrecord = Beer.find_by id: bid %>
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]